"appName" = "Inlaider (pl)";


"popup.command.placeholder.typeACommand" = "Type a command...";
"popup.command.placeholder.typeACommandOrEnterQuit" = "Type a command or press Enter to quit...";
"popup.command.placeholder.typeACommandOrEnterPaste" = "Type a command or press Enter to paste the result";
"popup.navigation.focusCanvas.label" = "⌘ ⬆️ — switches to editor";
"popup.navigation.focusCommandline.label" = "⌘ ⬇️ — switches to command line";
"popup.shortcut.clearCanvas" = "⌘⌫ clears the editor";
"popup.shortcut.copyCanvas" = "⌘C copies the editor content";
"popup.shortcut.copyCanvasOrEnterCopy" = "⌘C or Enter copies the editor content";
"popup.shortcut.enterPaste" = "Enter pastes into";
"popup.shortcut.esc" = "Esc closes to";

"show" = "Show";
"about" = "About";
"quit" = "Quit";
"close" = "Close";
"cancel" = "Cancel";
"save" = "Save";
"ok" = "OK";
"settings" = "Settings";
"copied" = "Copied";

"settings.section.general.title" = "General";
"settings.accessibility.title" = "Accessibility Permissions";
"settings.accessibility.description" = "This permission is required to automatically read the selected text and insert the processed result back into the original text field.\nWithout access, the app will use the clipboard to transfer data.";
"settings.inlaiderShortcut.label" = "Inlaider Keyboard Shortcut";
"settings.LaunchAtLogin.label" = "Launch at Login";

"settings.section.ownAPIKeys.title" = "Own API Keys";
"provider.apiKey.title" = "API Key";
"provider.apiKey.placeholder" = "Enter API key here";
"provider.models.title" = "Models";
"provider.models.new.placeholder" = "Add model name";

"settings.section.customPrompts.title" = "Prompt Replacements";
"prompts.general.title" = "General Prompt";
"prompts.replacements.title" = "Prompt Replacements";
"prompts.replacements.replaceWhat.label" = "Replace";
"prompts.replacements.model.label" = "Model";
"prompts.replacements.replaceWith.label" = "With Prompt";
"prompts.replacements.error.exists.message" = "Command replacement '%@' already exists.";

"about.ThirdPartyLicenses" = "Third Party Licenses";
"about.VisitOnGithub" = "Visit on GitHub";
"about.version" = "Version %@";

"error.title" = "Error";